artillery-placeOrder.yml
config:
  target: https://a67e6yxkbb.myprivaterelay.com/
  phases:
    - name: warming up
      duration: 30
      arrivalCount: 3
    - name: going up
      duration: 30
      arrivalCount: 6
    - name: holding up
      duration: 60
      arrivalCount: 18
  # Enable the Playwright engine:
  engines:
    playwright: {}
  processor: "./playwright-placeOrder.js"
scenarios:
  - engine: playwright
    flowFunction: "placeOrder"
    flow: []
    name: placeOrder